lib_app/app/controllers/libraries_controller.rb

INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["floor_count", 43], ["floor_area", 5], ["created_at", "2016-05-04 18:13:56.045007"], ["updated_at", "2016-05-04 18:13:56.045007"]]
---
  def create
    library_params = params.require(:library).permit(:name, :floor_count, :floor_area)
    @library = Library.create(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @library = Library.find_by_id(params[:id])